docs/example.xml

<?xml version="1.0"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <Action xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none" s:mustUnderstand="1">http://tempuri.org/IMethodInvokerService/InvokeServiceMethod</Action>
  </s:Header>
  <s:Body>
    <InvokeServiceMethod xmlns="http://tempuri.org/">
      <invokerParams xmlns:d4p1="http://schemas.datacontract.org/2004/07/Soneta.Net.Types" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <ClientAddress xmlns="http://schemas.datacontract.org/2004/07/Soneta.Types" i:nil="true"/>
        <ContextHandle xmlns="http://schemas.datacontract.org/2004/07/Soneta.Types" i:nil="true"/>
        <DatabaseHandle xmlns="http://schemas.datacontract.org/2004/07/Soneta.Types">PuroT2Kazimierz</DatabaseHandle>
        <IpFilters xmlns="http://schemas.datacontract.org/2004/07/Soneta.Types" i:nil="true"/>
        <MethodArgs xmlns:d5p1="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns="http://schemas.datacontract.org/2004/07/Soneta.Types">
          <d5p1:KeyValueOfstringanyType>
            <d5p1:Key>TableName</d5p1:Key>
            <d5p1:Value xmlns:d7p1="http://www.w3.org/2001/XMLSchema" i:type="d7p1:string">DokEwidencja</d5p1:Value>
          </d5p1:KeyValueOfstringanyType>
          <d5p1:KeyValueOfstringanyType>
            <d5p1:Key>SchemaName</d5p1:Key>
            <d5p1:Value xmlns:d7p1="http://www.w3.org/2001/XMLSchema" i:type="d7p1:string">Protel</d5p1:Value>
          </d5p1:KeyValueOfstringanyType>
          <d5p1:KeyValueOfstringanyType>
            <d5p1:Key>ResultSchemaName</d5p1:Key>
            <d5p1:Value i:nil="true"/>
          </d5p1:KeyValueOfstringanyType>
          <d5p1:KeyValueOfstringanyType>
            <d5p1:Key>ExternalSystem</d5p1:Key>
            <d5p1:Value xmlns:d7p1="http://www.w3.org/2001/XMLSchema" i:type="d7p1:string">30fb6c15-7596-44aa-bf3f-ca3ebfe0c983</d5p1:Value>
          </d5p1:KeyValueOfstringanyType>
          <d5p1:KeyValueOfstringanyType>
            <d5p1:Key>LocalRequest</d5p1:Key>
            <d5p1:Value xmlns:d7p1="http://www.w3.org/2001/XMLSchema" i:type="d7p1:boolean">false</d5p1:Value>
          </d5p1:KeyValueOfstringanyType>
          <d5p1:KeyValueOfstringanyType>
            <d5p1:Key>Data</d5p1:Key>
            <d5p1:Value xmlns:d7p1="http://www.w3.org/2001/XMLSchema" i:type="d7p1:string">
              <UpdateParamsData>
                <Rows>
                  <Row>
                    <Xml>
                      <Dokument>
                        <invoice_fiscalcode>112</invoice_fiscalcode>
                        <Podmiot>
                          <invoice_customername>Smith &amp;amp; Nephew Sp. z o.o.</invoice_customername>
                          <invoice_customertaxid>526 28 25 537</invoice_customertaxid>
                          <invoice_customeraddress>ul. Osma&#x144;ska 12 02-823 Warszawa</invoice_customeraddress>
                          <invoice_protel_customerid>60024</invoice_protel_customerid>
                        </Podmiot>
                        <Naglowek>
                          <invoice_protel_reservationno>1103664</invoice_protel_reservationno>
                          <invoice_cancelled>True</invoice_cancelled>
                          <invoice_cancell_dt>2021-06-30</invoice_cancell_dt>
                          <invoice_type>1</invoice_type>
                          <invoice_nostr>25103/05/2021</invoice_nostr>
                          <invoice_saledate>2021-05-18</invoice_saledate>
                          <invoice_issuedate>2021-05-19</invoice_issuedate>
                          <invoice_id>691442</invoice_id>
                          <invoice_note1>Chmarek Jacek</invoice_note1>
                          <invoice_note2>Chmarek Jacek1</invoice_note2>
                          <invoice_note3/>
                          <invoice_property_name>Puro Hotel Warszawa</invoice_property_name>
                          <invoice_propertyid>9</invoice_propertyid>
                          <invoice_gtu/>
                          <invoice_dfeature/>
                          <invoice_protel_datefrom>2021-05-18</invoice_protel_datefrom>
                          <invoice_protel_dateto>2021-05-19</invoice_protel_dateto>
                        </Naglowek>
                        <LinkedDocument>
                          <CorrectedDocuments>
                            <CorrectedDocument>
                              <invoice_originalinvoicenostr>39943/02/2021</invoice_originalinvoicenostr>
                            </CorrectedDocument>
                          </CorrectedDocuments>
                        </LinkedDocument>
                        <VAT>
                          <VATTable>
                            <VATTableItem>
                              <VATRate>
                                <invoicevat_vatcode>B</invoicevat_vatcode>
                                <invoicevat_vatrate>8,00</invoicevat_vatrate>
                              </VATRate>
                              <invoicevat_vatamount>27,41</invoicevat_vatamount>
                              <invoicevat_grossamount>370,00</invoicevat_grossamount>
                              <invoicedtl_currency>PLN</invoicedtl_currency>
                              <invoicevat_vatcurrencyamount>27,41</invoicevat_vatcurrencyamount>
                              <invoicedtl_grosscurrencyamount>370,00</invoicedtl_grosscurrencyamount>
                              <invoicevat_id>961519</invoicevat_id>
                              <invoicevat_invoiceid>691442</invoicevat_invoiceid>
                              <invoicevat_itemtype>2</invoicevat_itemtype>
                              <invoicevat_vatratetxt>8.00</invoicevat_vatratetxt>
                            </VATTableItem>
                            <VATTableItem>
                              <VATRate>
                                <invoicevat_vatcode>A</invoicevat_vatcode>
                                <invoicevat_vatrate>23,00</invoicevat_vatrate>
                              </VATRate>
                              <invoicevat_vatamount>18,70</invoicevat_vatamount>
                              <invoicevat_grossamount>100,00</invoicevat_grossamount>
                              <invoicedtl_currency>PLN</invoicedtl_currency>
                              <invoicevat_vatcurrencyamount>18,70</invoicevat_vatcurrencyamount>
                              <invoicedtl_grosscurrencyamount>100,00</invoicedtl_grosscurrencyamount>
                              <invoicevat_id>961520</invoicevat_id>
                              <invoicevat_invoiceid>691442</invoicevat_invoiceid>
                              <invoicevat_itemtype>2</invoicevat_itemtype>
                              <invoicevat_vatratetxt>23.00</invoicevat_vatratetxt>
                            </VATTableItem>
                          </VATTable>
                        </VAT>
                        <payments>
                          <Payment>
                            <invoicedtl_currency>PLN</invoicedtl_currency>
                            <invoicedtl_grosscurrencyamount>470</invoicedtl_grosscurrencyamount>
                            <invoice_duedate>2021-05-19</invoice_duedate>
                            <invoicedtl_postingtext>Karta kredytowa</invoicedtl_postingtext>
                            <invoicedtl_postdate>2021-05-19</invoicedtl_postdate>
                            <invoice_cc/>
                            <invoicedtl_realdate>2021-05-19</invoicedtl_realdate>
                            <invoicedtl_reservationid>1103664</invoicedtl_reservationid>
                            <invoicedtl_id>4672384</invoicedtl_id>
                            <invoicedtl_deposit>false</invoicedtl_deposit>
                            <invoicedtl_payment>true</invoicedtl_payment>
                            <invoicedtl_invoiceid>691442</invoicedtl_invoiceid>
                          </Payment>
                        </payments>
                        <OpisAnalityczny>
                          <ElementOpisu>
                            <invoicedtl_vatamount>18,7</invoicedtl_vatamount>
                            <invoicedtl_currency>PLN</invoicedtl_currency>
                            <invoicedtl_grosscurrencyamount>100</invoicedtl_grosscurrencyamount>
                            <invoicedtl_grossamount>100</invoicedtl_grossamount>
                            <invoicedtl_originid>1103664</invoicedtl_originid>
                            <invoicedtl_paymentaccount/>
                            <invoicedtl_realdate>2021-05-18</invoicedtl_realdate>
                            <invoicedtl_postingaddtext/>
                            <invoicedtl_postingtext>Parking (Parking)</invoicedtl_postingtext>
                            <invoicedtl_protel_paymentname/>
                            <invoicedtl_protel_transname>Parking (Parking)</invoicedtl_protel_transname>
                            <invoicedtl_quantity>1</invoicedtl_quantity>
                            <invoicedtl_reservationid>1103664</invoicedtl_reservationid>
                            <invoicedtl_transaccount/>
                            <invoicedtl_vatcode>A</invoicedtl_vatcode>
                            <invoicedtl_vatcurrencyamount>18,7</invoicedtl_vatcurrencyamount>
                            <invoicedtl_id>4672381</invoicedtl_id>
                            <invoicedtl_sourcetransactionid>6</invoicedtl_sourcetransactionid>
                            <invoicedtl_postdate>2021-05-18</invoicedtl_postdate>
                            <invoicedtl_deposit>false</invoicedtl_deposit>
                            <invoicedtl_payment>false</invoicedtl_payment>
                            <invoicedtl_invoiceid>691442</invoicedtl_invoiceid>
                          </ElementOpisu>
                          <ElementOpisu>
                            <invoicedtl_vatamount>2,96</invoicedtl_vatamount>
                            <invoicedtl_currency>PLN</invoicedtl_currency>
                            <invoicedtl_grosscurrencyamount>40</invoicedtl_grosscurrencyamount>
                            <invoicedtl_grossamount>40</invoicedtl_grossamount>
                            <invoicedtl_originid>1103664</invoicedtl_originid>
                            <invoicedtl_paymentaccount/>
                            <invoicedtl_realdate>2021-05-18</invoicedtl_realdate>
                            <invoicedtl_postingaddtext>18/05/21/#418</invoicedtl_postingaddtext>
                            <invoicedtl_postingtext>Us&#x142;uga noclegowa (Accommodation)</invoicedtl_postingtext>
                            <invoicedtl_protel_paymentname/>
                            <invoicedtl_protel_transname>&#x15A;niadanie (Breakfast)</invoicedtl_protel_transname>
                            <invoicedtl_quantity>1</invoicedtl_quantity>
                            <invoicedtl_reservationid>1103664</invoicedtl_reservationid>
                            <invoicedtl_transaccount/>
                            <invoicedtl_vatcode>B</invoicedtl_vatcode>
                            <invoicedtl_vatcurrencyamount>2,96</invoicedtl_vatcurrencyamount>
                            <invoicedtl_id>4672382</invoicedtl_id>
                            <invoicedtl_sourcetransactionid>132</invoicedtl_sourcetransactionid>
                            <invoicedtl_postdate>2021-05-18</invoicedtl_postdate>
                            <invoicedtl_deposit>false</invoicedtl_deposit>
                            <invoicedtl_payment>false</invoicedtl_payment>
                            <invoicedtl_invoiceid>691442</invoicedtl_invoiceid>
                          </ElementOpisu>
                          <ElementOpisu>
                            <invoicedtl_vatamount>24,45</invoicedtl_vatamount>
                            <invoicedtl_currency>PLN</invoicedtl_currency>
                            <invoicedtl_grosscurrencyamount>330</invoicedtl_grosscurrencyamount>
                            <invoicedtl_grossamount>330</invoicedtl_grossamount>
                            <invoicedtl_originid>1103664</invoicedtl_originid>
                            <invoicedtl_paymentaccount/>
                            <invoicedtl_realdate>2021-05-18</invoicedtl_realdate>
                            <invoicedtl_postingaddtext>18/05/21/#418</invoicedtl_postingaddtext>
                            <invoicedtl_postingtext>Us&#x142;uga noclegowa (Accommodation)</invoicedtl_postingtext>
                            <invoicedtl_protel_paymentname/>
                            <invoicedtl_protel_transname>Us&#x142;uga noclegowa (Accommodation)</invoicedtl_protel_transname>
                            <invoicedtl_quantity>1</invoicedtl_quantity>
                            <invoicedtl_reservationid>1103664</invoicedtl_reservationid>
                            <invoicedtl_transaccount/>
                            <invoicedtl_vatcode>B</invoicedtl_vatcode>
                            <invoicedtl_vatcurrencyamount>24,44</invoicedtl_vatcurrencyamount>
                            <invoicedtl_id>4672383</invoicedtl_id>
                            <invoicedtl_sourcetransactionid>1</invoicedtl_sourcetransactionid>
                            <invoicedtl_postdate>2021-05-18</invoicedtl_postdate>
                            <invoicedtl_deposit>false</invoicedtl_deposit>
                            <invoicedtl_payment>false</invoicedtl_payment>
                            <invoicedtl_invoiceid>691442</invoicedtl_invoiceid>
                          </ElementOpisu>
                        </OpisAnalityczny>
                        <Attachments>
                          <Attachment>
                            <invoice_no>25103</invoice_no>
                            <pdf_link>Hotel 9\112\00025103.pdf</pdf_link>
                          </Attachment>
                        </Attachments>
                      </Dokument>
                    </Xml>
                  </Row>
                </Rows>
              </UpdateParamsData>
            </d5p1:Value>
          </d5p1:KeyValueOfstringanyType>
          <d5p1:KeyValueOfstringanyType>
            <d5p1:Key>SchemaParam</d5p1:Key>
            <d5p1:Value xmlns:d7p1="http://www.w3.org/2001/XMLSchema" i:type="d7p1:string"/>
          </d5p1:KeyValueOfstringanyType>
        </MethodArgs>
        <MethodName xmlns="http://schemas.datacontract.org/2004/07/Soneta.Types">Update</MethodName>
        <Operator xmlns="http://schemas.datacontract.org/2004/07/Soneta.Types">MEWS</Operator>
        <Password xmlns="http://schemas.datacontract.org/2004/07/Soneta.Types">7wfpBC3IbtWCiOAlDX 0m</Password>
        <ServiceName xmlns="http://schemas.datacontract.org/2004/07/Soneta.Types">enova.Integrator.I Integrator, enova.Integrator</ServiceName>
        <d4p1:ConnectionInfo i:nil="true"/>
      </invokerParams>
    </InvokeServiceMethod>
  </s:Body>
</s:Envelope>
